-- Copyright (c) 2016-present, Facebook, Inc.
-- All rights reserved.
--
-- This source code is licensed under the BSD-style license found in the
-- LICENSE file in the root directory of this source tree.


{-# LANGUAGE GADTs #-}
{-# LANGUAGE OverloadedStrings #-}

module Duckling.Ordinal.GU.Rules
  ( rules
  ) where

import Data.HashMap.Strict (HashMap)
import Data.Text (Text)
import qualified Data.Text as Text
import Prelude
import qualified Data.HashMap.Strict as HashMap

import Duckling.Dimensions.Types
import Duckling.Numeral.Helpers (parseInt)
import Duckling.Ordinal.Helpers
import Duckling.Regex.Types
import Duckling.Types

ordinalsMap :: HashMap Text Int
ordinalsMap = HashMap.fromList
  [ ( "પ્રથમ", 1 )
  , ( "પહેલું", 1 )
  , ( "પહેલો", 1 )
  , ( "પહેલી", 1 )
  , ( "પહેલાં", 1 )
  , ( "પહેલા", 1 )
  , ( "દ્વિતીય", 2 )
  , ( "બીજું", 2 )
  , ( "બીજો", 2 )
  , ( "બીજી", 2 )
  , ( "બીજાં", 2 )
  , ( "બીજા", 2 )
  , ( "તૃતીય", 3 )
  , ( "ત્રીજું", 3 )
  , ( "ત્રીજો", 3 )
  , ( "ત્રીજી", 3 )
  , ( "ત્રીજાં", 3 )
  , ( "ત્રીજા", 3 )
  , ( "ચોથું", 4 )
  , ( "ચોથો", 4 )
  , ( "ચોથી", 4 )
  , ( "ચોથાં", 4 )
  , ( "ચોથા", 4 )
  , ( "પાંચમું", 5 )
  , ( "પાંચમો", 5 )
  , ( "પાંચમી", 5 )
  , ( "પાંચમાં", 5 )
  , ( "પાંચમા", 5 )
  , ( "છઠ્ઠું", 6 )
  , ( "છઠ્ઠો", 6 )
  , ( "છઠ્ઠી", 6 )
  , ( "છઠ્ઠાં", 6 )
  , ( "છઠ્ઠા", 6 )
  , ( "સાતમું", 7 )
  , ( "સાતમો", 7 )
  , ( "સાતમી", 7 )
  , ( "સાતમા", 7 )
  , ( "આઠમું", 8 )
  , ( "આઠમો", 8 )
  , ( "આઠમી", 8 )
  , ( "આઠમા", 8 )
  , ( "નવમું", 9 )
  , ( "નવમો", 9 )
  , ( "નવમી", 9 )
  , ( "નવમા", 9 )
  , ( "દસમું", 10 )
  , ( "દસમો", 10 )
  , ( "દસમી", 10 )
  , ( "દસમા", 10 )
  , ( "છેલ્લું", -1 )
  , ( "છેલ્લો", -1 )
  , ( "છેલ્લી", -1 )
  , ( "છેલ્લાં", -1 )
  , ( "છેલ્લા", -1 )
  , ( "આખરી", -1 )
  ]

ruleOrdinals :: Rule
ruleOrdinals = Rule
  { name = "ordinals (first..tenth)"
  , pattern =
    [ regex "(પ્રથમ|પહેલું|પહેલો|પહેલી|પહેલાં|પહેલા|દ્વિતીય|બીજું|બીજો|બીજી|બીજાં|બીજા|તૃતીય|ત્રીજું|ત્રીજો|ત્રીજી|ત્રીજાં|ત્રીજા|ચોથું|ચોથો|ચોથી|ચોથાં|ચોથા|પાંચમું|પાંચમો|પાંચમી|પાંચમાં|પાંચમા|છઠ્ઠું|છઠ્ઠો|છઠ્ઠી|છઠ્ઠાં|છઠ્ઠા|સાતમું|સાતમો|સાતમી|સાતમા|આઠમું|આઠમો|આઠમી|આઠમા|નવમું|નવમો|નવમી|નવમા|દસમું|દસમો|દસમી|દસમા|છેલ્લું|છેલ્લો|છેલ્લી|છેલ્લાં|છેલ્લા|આખરી)"
    ]
  , prod = \tokens -> case tokens of
      (Token RegexMatch (GroupMatch (match:_)):_) ->
        ordinal <$> HashMap.lookup match ordinalsMap
      _ -> Nothing
  }

cardinalsMap :: HashMap Text Int
cardinalsMap = HashMap.fromList
  [ ( "અગિયાર", 11 )
  , ( "બાર", 12 )
  , ( "તેર", 13 )
  , ( "ચૌદ", 14 )
  , ( "પંદર", 15 )
  , ( "સોળ", 16 )
  , ( "સત્તર", 17 )
  , ( "અઢાર", 18 )
  , ( "ઓગણીસ", 19 )
  , ( "વીસ", 20 )
  , ( "વીશ", 20 )
  , ( "એકવીસ", 21 )
  , ( "બાવીસ", 22 )
  , ( "તેવીસ", 23 )
  , ( "ચોવીસ", 24 )
  , ( "પચ્ચીસ", 25 )
  , ( "છવ્વીસ", 26 )
  , ( "સત્તાવીસ", 27 )
  , ( "અઠ્ઠાવીસ", 28 )
  , ( "ઓગણત્રીસ", 29 )
  , ( "ત્રીસ", 30 )
  , ( "એકત્રીસ", 31 )
  , ( "બત્રીસ", 32 )
  , ( "તેત્રીસ", 33 )
  , ( "ચોત્રીસ", 34 )
  , ( "પાંત્રીસ", 35 )
  , ( "છત્રીસ", 36 )
  , ( "સાડત્રીસ", 37 )
  , ( "અડત્રીસ", 38 )
  , ( "ઓગણચાલીસ", 39 )
  , ( "ચાલીસ", 40 )
  , ( "એકતાલીસ", 41 )
  , ( "બેતાલીસ", 42 )
  , ( "તેતાલીસ", 43 )
  , ( "ચોતાલીસ", 44 )
  , ( "પિસ્તાલીસ", 45 )
  , ( "છેતાલીસ", 46 )
  , ( "સુડતાલીસ", 47 )
  , ( "અડતાલીસ", 48 )
  , ( "ઓગણપચાસ", 49 )
  , ( "પચાસ", 50 )
  , ( "એકાવન", 51 )
  , ( "બાવન", 52 )
  , ( "ત્રેપન", 53 )
  , ( "ચોપન", 54 )
  , ( "પંચાવન", 55 )
  , ( "છપ્પન", 56 )
  , ( "સત્તાવન", 57 )
  , ( "અઠ્ઠાવન", 58 )
  , ( "ઓગણસાઠ", 59 )
  , ( "સાઠ", 60 )
  , ( "એકસઠ", 61 )
  , ( "બાસઠ", 62 )
  , ( "ત્રેસઠ", 63 )
  , ( "ચોસઠ", 64 )
  , ( "પાંસઠ", 65 )
  , ( "છાસઠ", 66 )
  , ( "સડસઠ", 67 )
  , ( "અડસઠ", 68 )
  , ( "ઓગણસિત્તેર", 69 )
  , ( "સિત્તેર", 70 )
  , ( "એકોતેર", 71 )
  , ( "બોતેર", 72 )
  , ( "તોતેર", 73 )
  , ( "ચુમ્મોતેર", 74 )
  , ( "પંચોતેર", 75 )
  , ( "છોતેર", 76 )
  , ( "સત્યોતેર", 77 )
  , ( "અઠ્યોતેર", 78 )
  , ( "ઓગણએંસી", 79 )
  , ( "એંસી", 80 )
  , ( "એક્યાસી", 81 )
  , ( "બ્યાસી", 82 )
  , ( "ત્યાસી", 83 )
  , ( "ચોર્યાસી", 84 )
  , ( "પંચાસી", 85 )
  , ( "છ્યાસી", 86 )
  , ( "સત્યાસી", 87 )
  , ( "અઠ્યાસી", 88 )
  , ( "નવાસી", 89 )
  , ( "નેવુ", 90 )
  , ( "એકાણું", 91 )
  , ( "બાણું", 92 )
  , ( "ત્રાણું", 93 )
  , ( "ચોરાણું", 94 )
  , ( "પંચાણું", 95 )
  , ( "છન્નું", 96 )
  , ( "સત્તાણું", 97 )
  , ( "અઠ્ઠાણું", 98 )
  , ( "નવ્વાણું", 99 )
  ]

ruleOtherOrdinals :: Rule
ruleOtherOrdinals = Rule
  { name = "ordinals (eleventh..ninety-ninth)"
  , pattern =
    [ regex "(અગિયાર|બાર|તેર|ચૌદ|પંદર|સોળ|સત્તર|અઢાર|ઓગણીસ|વીસ|વીશ|એકવીસ|બાવીસ|તેવીસ|ચોવીસ|પચ્ચીસ|છવ્વીસ|સત્તાવીસ|અઠ્ઠાવીસ|ઓગણત્રીસ|ત્રીસ|એકત્રીસ|બત્રીસ|તેત્રીસ|ચોત્રીસ|પાંત્રીસ|છત્રીસ|સાડત્રીસ|અડત્રીસ|ઓગણચાલીસ|ચાલીસ|એકતાલીસ|બેતાલીસ|તેતાલીસ|ચોતાલીસ|પિસ્તાલીસ|છેતાલીસ|સુડતાલીસ|અડતાલીસ|ઓગણપચાસ|પચાસ|એકાવન|બાવન|ત્રેપન|ચોપન|પંચાવન|છપ્પન|સત્તાવન|અઠ્ઠાવન|ઓગણસાઠ|સાઠ|એકસઠ|બાસઠ|ત્રેસઠ|ચોસઠ|પાંસઠ|છાસઠ|સડસઠ|અડસઠ|ઓગણસિત્તેર|સિત્તેર|એકોતેર|બોતેર|તોતેર|ચુમ્મોતેર|પંચોતેર|છોતેર|સત્યોતેર|અઠ્યોતેર|ઓગણએંસી|એંસી|એક્યાસી|બ્યાસી|ત્યાસી|ચોર્યાસી|પંચાસી|છ્યાસી|સત્યાસી|અઠ્યાસી|નવાસી|નેવુ|એકાણું|બાણું|ત્રાણું|ચોરાણું|પંચાણું|છન્નું|સત્તાણું|અઠ્ઠાણું|નવ્વાણું)(મું|મો|મી|માં|મા)"
    ]
  , prod = \tokens -> case tokens of
      (Token RegexMatch (GroupMatch (match:_)):_) ->
        ordinal <$> HashMap.lookup match cardinalsMap
      _ -> Nothing
  }

gujaratiDigitMap :: HashMap Char Char
gujaratiDigitMap = HashMap.fromList
  [ ( '૦', '0' )
  , ( '૧', '1' )
  , ( '૨', '2' )
  , ( '૩', '3' )
  , ( '૪', '4' )
  , ( '૫', '5' )
  , ( '૬', '6' )
  , ( '૭', '7' )
  , ( '૮', '8' )
  , ( '૯', '9' )
  ]

ruleOrdinalDigits :: Rule
ruleOrdinalDigits = Rule
  { name = "ordinal (digits)"
  , pattern = [regex "0*([\\d૦-૯]+) ?(મું|મો|મી|માં|મા)"]
  , prod = \tokens -> case tokens of
      (Token RegexMatch (GroupMatch (match:_)):_) ->
        let clean = Text.map (\c -> HashMap.lookupDefault c c gujaratiDigitMap) match
        in ordinal <$> parseInt clean
      _ -> Nothing
  }

rules :: [Rule]
rules =
  [ ruleOrdinals
  , ruleOtherOrdinals
  , ruleOrdinalDigits
  ]
